espressif/esp-idf/components/soc/esp32s3/include/soc/sens_reg.h
#define SENS_SAR_NOUSE_REG          (DR_REG_SENS_BASE + 0x100)
/* SENS_SAR_NOUSE : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define SENS_SAR_NOUSE    0xFFFFFFFF
#define SENS_SAR_NOUSE_M  ((SENS_SAR_NOUSE_V)<<(SENS_SAR_NOUSE_S))
#define SENS_SAR_NOUSE_V  0xFFFFFFFF
#define SENS_SAR_NOUSE_S  0

#define SENS_SAR_PERI_CLK_GATE_CONF_REG          (DR_REG_SENS_BASE + 0x104)
/* SENS_IOMUX_CLK_EN : R/W ;bitpos:[31] ;default: 1'd0 ; */
/*description: .*/
#define SENS_IOMUX_CLK_EN    (BIT(31))
#define SENS_IOMUX_CLK_EN_M  (BIT(31))
#define SENS_IOMUX_CLK_EN_V  0x1
#define SENS_IOMUX_CLK_EN_S  31
/* SENS_SARADC_CLK_EN : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: .*/
#define SENS_SARADC_CLK_EN    (BIT(30))
#define SENS_SARADC_CLK_EN_M  (BIT(30))
#define SENS_SARADC_CLK_EN_V  0x1
#define SENS_SARADC_CLK_EN_S  30
/* SENS_TSENS_CLK_EN : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: .*/
#define SENS_TSENS_CLK_EN    (BIT(29))
#define SENS_TSENS_CLK_EN_M  (BIT(29))
#define SENS_TSENS_CLK_EN_V  0x1
#define SENS_TSENS_CLK_EN_S  29
/* SENS_RTC_I2C_CLK_EN : R/W ;bitpos:[27] ;default: 1'b0 ; */
/*description: .*/
#define SENS_RTC_I2C_CLK_EN    (BIT(27))
#define SENS_RTC_I2C_CLK_EN_M  (BIT(27))
#define SENS_RTC_I2C_CLK_EN_V  0x1
#define SENS_RTC_I2C_CLK_EN_S  27

#define SENS_SAR_PERI_RESET_CONF_REG          (DR_REG_SENS_BASE + 0x108)
/* SENS_SARADC_RESET : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: .*/
#define SENS_SARADC_RESET    (BIT(30))
#define SENS_SARADC_RESET_M  (BIT(30))
#define SENS_SARADC_RESET_V  0x1
#define SENS_SARADC_RESET_S  30
/* SENS_TSENS_RESET : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: .*/
#define SENS_TSENS_RESET    (BIT(29))
#define SENS_TSENS_RESET_M  (BIT(29))
#define SENS_TSENS_RESET_V  0x1
#define SENS_TSENS_RESET_S  29
/* SENS_RTC_I2C_RESET : R/W ;bitpos:[27] ;default: 1'b0 ; */
/*description: .*/
#define SENS_RTC_I2C_RESET    (BIT(27))
#define SENS_RTC_I2C_RESET_M  (BIT(27))
#define SENS_RTC_I2C_RESET_V  0x1
#define SENS_RTC_I2C_RESET_S  27
/* SENS_COCPU_RESET : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_RESET    (BIT(25))
#define SENS_COCPU_RESET_M  (BIT(25))
#define SENS_COCPU_RESET_V  0x1
#define SENS_COCPU_RESET_S  25

#define SENS_SAR_COCPU_INT_ENA_W1TS_REG          (DR_REG_SENS_BASE + 0x10C)
/* SENS_COCPU_TOUCH_SCAN_DONE_INT_ENA_W1TS : WO ;bitpos:[11] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_TOUCH_SCAN_DONE_INT_ENA_W1TS    (BIT(11))
#define SENS_COCPU_TOUCH_SCAN_DONE_INT_ENA_W1TS_M  (BIT(11))
#define SENS_COCPU_TOUCH_SCAN_DONE_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_TOUCH_SCAN_DONE_INT_ENA_W1TS_S  11
/* SENS_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS : WO ;bitpos:[10] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS    (BIT(10))
#define SENS_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS_M  (BIT(10))
#define SENS_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS_S  10
/* SENS_COCPU_TOUCH_TIMEOUT_INT_ENA_W1TS : WO ;bitpos:[9] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_TOUCH_TIMEOUT_INT_ENA_W1TS    (BIT(9))
#define SENS_COCPU_TOUCH_TIMEOUT_INT_ENA_W1TS_M  (BIT(9))
#define SENS_COCPU_TOUCH_TIMEOUT_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_TOUCH_TIMEOUT_INT_ENA_W1TS_S  9
/* SENS_COCPU_SWD_INT_ENA_W1TS : WO ;bitpos:[8] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_SWD_INT_ENA_W1TS    (BIT(8))
#define SENS_COCPU_SWD_INT_ENA_W1TS_M  (BIT(8))
#define SENS_COCPU_SWD_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_SWD_INT_ENA_W1TS_S  8
/* SENS_COCPU_SW_INT_ENA_W1TS : WO ;bitpos:[7] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_SW_INT_ENA_W1TS    (BIT(7))
#define SENS_COCPU_SW_INT_ENA_W1TS_M  (BIT(7))
#define SENS_COCPU_SW_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_SW_INT_ENA_W1TS_S  7
/* SENS_COCPU_START_INT_ENA_W1TS : WO ;bitpos:[6] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_START_INT_ENA_W1TS    (BIT(6))
#define SENS_COCPU_START_INT_ENA_W1TS_M  (BIT(6))
#define SENS_COCPU_START_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_START_INT_ENA_W1TS_S  6
/* SENS_COCPU_TSENS_INT_ENA_W1TS : WO ;bitpos:[5] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_TSENS_INT_ENA_W1TS    (BIT(5))
#define SENS_COCPU_TSENS_INT_ENA_W1TS_M  (BIT(5))
#define SENS_COCPU_TSENS_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_TSENS_INT_ENA_W1TS_S  5
/* SENS_COCPU_SARADC2_INT_ENA_W1TS : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_SARADC2_INT_ENA_W1TS    (BIT(4))
#define SENS_COCPU_SARADC2_INT_ENA_W1TS_M  (BIT(4))
#define SENS_COCPU_SARADC2_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_SARADC2_INT_ENA_W1TS_S  4
/* SENS_COCPU_SARADC1_INT_ENA_W1TS : WO ;bitpos:[3] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_SARADC1_INT_ENA_W1TS    (BIT(3))
#define SENS_COCPU_SARADC1_INT_ENA_W1TS_M  (BIT(3))
#define SENS_COCPU_SARADC1_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_SARADC1_INT_ENA_W1TS_S  3
/* SENS_COCPU_TOUCH_ACTIVE_INT_ENA_W1TS : WO ;bitpos:[2] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_TOUCH_ACTIVE_INT_ENA_W1TS    (BIT(2))
#define SENS_COCPU_TOUCH_ACTIVE_INT_ENA_W1TS_M  (BIT(2))
#define SENS_COCPU_TOUCH_ACTIVE_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_TOUCH_ACTIVE_INT_ENA_W1TS_S  2
/* SENS_COCPU_TOUCH_INACTIVE_INT_ENA_W1TS : WO ;bitpos:[1] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_TOUCH_INACTIVE_INT_ENA_W1TS    (BIT(1))
#define SENS_COCPU_TOUCH_INACTIVE_INT_ENA_W1TS_M  (BIT(1))
#define SENS_COCPU_TOUCH_INACTIVE_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_TOUCH_INACTIVE_INT_ENA_W1TS_S  1
/* SENS_COCPU_TOUCH_DONE_INT_ENA_W1TS : WO ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_TOUCH_DONE_INT_ENA_W1TS    (BIT(0))
#define SENS_COCPU_TOUCH_DONE_INT_ENA_W1TS_M  (BIT(0))
#define SENS_COCPU_TOUCH_DONE_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_TOUCH_DONE_INT_ENA_W1TS_S  0

#define SENS_SAR_COCPU_INT_ENA_W1TC_REG          (DR_REG_SENS_BASE + 0x110)
/* SENS_COCPU_TOUCH_SCAN_DONE_INT_ENA_W1TC : WO ;bitpos:[11] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_TOUCH_SCAN_DONE_INT_ENA_W1TC    (BIT(11))
#define SENS_COCPU_TOUCH_SCAN_DONE_INT_ENA_W1TC_M  (BIT(11))
#define SENS_COCPU_TOUCH_SCAN_DONE_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_TOUCH_SCAN_DONE_INT_ENA_W1TC_S  11
/* SENS_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC : WO ;bitpos:[10] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC    (BIT(10))
#define SENS_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC_M  (BIT(10))
#define SENS_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC_S  10
/* SENS_COCPU_TOUCH_TIMEOUT_INT_ENA_W1TC : WO ;bitpos:[9] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_TOUCH_TIMEOUT_INT_ENA_W1TC    (BIT(9))
#define SENS_COCPU_TOUCH_TIMEOUT_INT_ENA_W1TC_M  (BIT(9))
#define SENS_COCPU_TOUCH_TIMEOUT_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_TOUCH_TIMEOUT_INT_ENA_W1TC_S  9
/* SENS_COCPU_SWD_INT_ENA_W1TC : WO ;bitpos:[8] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_SWD_INT_ENA_W1TC    (BIT(8))
#define SENS_COCPU_SWD_INT_ENA_W1TC_M  (BIT(8))
#define SENS_COCPU_SWD_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_SWD_INT_ENA_W1TC_S  8
/* SENS_COCPU_SW_INT_ENA_W1TC : WO ;bitpos:[7] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_SW_INT_ENA_W1TC    (BIT(7))
#define SENS_COCPU_SW_INT_ENA_W1TC_M  (BIT(7))
#define SENS_COCPU_SW_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_SW_INT_ENA_W1TC_S  7
/* SENS_COCPU_START_INT_ENA_W1TC : WO ;bitpos:[6] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_START_INT_ENA_W1TC    (BIT(6))
#define SENS_COCPU_START_INT_ENA_W1TC_M  (BIT(6))
#define SENS_COCPU_START_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_START_INT_ENA_W1TC_S  6
/* SENS_COCPU_TSENS_INT_ENA_W1TC : WO ;bitpos:[5] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_TSENS_INT_ENA_W1TC    (BIT(5))
#define SENS_COCPU_TSENS_INT_ENA_W1TC_M  (BIT(5))
#define SENS_COCPU_TSENS_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_TSENS_INT_ENA_W1TC_S  5
/* SENS_COCPU_SARADC2_INT_ENA_W1TC : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_SARADC2_INT_ENA_W1TC    (BIT(4))
#define SENS_COCPU_SARADC2_INT_ENA_W1TC_M  (BIT(4))
#define SENS_COCPU_SARADC2_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_SARADC2_INT_ENA_W1TC_S  4
/* SENS_COCPU_SARADC1_INT_ENA_W1TC : WO ;bitpos:[3] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_SARADC1_INT_ENA_W1TC    (BIT(3))
#define SENS_COCPU_SARADC1_INT_ENA_W1TC_M  (BIT(3))
#define SENS_COCPU_SARADC1_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_SARADC1_INT_ENA_W1TC_S  3
/* SENS_COCPU_TOUCH_ACTIVE_INT_ENA_W1TC : WO ;bitpos:[2] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_TOUCH_ACTIVE_INT_ENA_W1TC    (BIT(2))
#define SENS_COCPU_TOUCH_ACTIVE_INT_ENA_W1TC_M  (BIT(2))
#define SENS_COCPU_TOUCH_ACTIVE_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_TOUCH_ACTIVE_INT_ENA_W1TC_S  2
/* SENS_COCPU_TOUCH_INACTIVE_INT_ENA_W1TC : WO ;bitpos:[1] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_TOUCH_INACTIVE_INT_ENA_W1TC    (BIT(1))
#define SENS_COCPU_TOUCH_INACTIVE_INT_ENA_W1TC_M  (BIT(1))
#define SENS_COCPU_TOUCH_INACTIVE_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_TOUCH_INACTIVE_INT_ENA_W1TC_S  1
/* SENS_COCPU_TOUCH_DONE_INT_ENA_W1TC : WO ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define SENS_COCPU_TOUCH_DONE_INT_ENA_W1TC    (BIT(0))
#define SENS_COCPU_TOUCH_DONE_INT_ENA_W1TC_M  (BIT(0))
#define SENS_COCPU_TOUCH_DONE_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_TOUCH_DONE_INT_ENA_W1TC_S  0

#define SENS_SAR_DEBUG_CONF_REG          (DR_REG_SENS_BASE + 0x114)
/* SENS_DEBUG_BIT_SEL : R/W ;bitpos:[4:0] ;default: 5'b0 ; */
/*description: .*/
#define SENS_DEBUG_BIT_SEL    0x0000001F
#define SENS_DEBUG_BIT_SEL_M  ((SENS_DEBUG_BIT_SEL_V)<<(SENS_DEBUG_BIT_SEL_S))
#define SENS_DEBUG_BIT_SEL_V  0x1F
#define SENS_DEBUG_BIT_SEL_S  0

#define SENS_SARDATE_REG          (DR_REG_SENS_BASE + 0x1FC)
/* SENS_SAR_DATE : R/W ;bitpos:[27:0] ;default: 28'h2101180 ; */
/*description: .*/
#define SENS_SAR_DATE    0x0FFFFFFF
#define SENS_SAR_DATE_M  ((SENS_SAR_DATE_V)<<(SENS_SAR_DATE_S))
#define SENS_SAR_DATE_V  0xFFFFFFF
#define SENS_SAR_DATE_S  0


#ifdef __cplusplus
}
#endif



#endif /*_SOC_SENS_REG_H_ */
